In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('sales.csv',index_col='month')

In [4]:
df

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [5]:
df['huevos']

month
Enero       47
Febrero    110
Marzo      221
Abril       77
Mayo       132
Junio      205
Name: huevos, dtype: int64

In [6]:
type(df['huevos'])

pandas.core.series.Series

In [7]:
type(df[['huevos']])

pandas.core.frame.DataFrame

In [8]:
#Slicing and indexing a Series

In [10]:
df['huevos'][1:4]

month
Febrero    110
Marzo      221
Abril       77
Name: huevos, dtype: int64

In [11]:
df['huevos'][4]

132

In [12]:
#Using .loc[]

In [14]:
df.loc[:,'huevos':'sal']

         huevos   sal
month
Enero        47  12.0
Febrero     110  50.0
Marzo       221  89.0
Abril        77  87.0
Mayo        132   NaN
Junio       205  60.0

In [15]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

In [16]:
df.loc[:]

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [17]:
#Enero a abril con todas las columnas

In [19]:
df.loc['Enero':'Abril',:]

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0

In [20]:
#marzo a mayo , las columnas sal y jamon

In [21]:
df.loc['Marzo':'Mayo','sal':'jamon']

        sal  jamon
month
Marzo  89.0   72.0
Abril  87.0   20.0
Mayo    NaN   52.0

In [22]:
#Using .iloc[]

In [25]:
df.iloc[2:5,1:]

        sal  jamon
month
Marzo  89.0   72.0
Abril  87.0   20.0
Mayo    NaN   52.0

In [27]:
df.loc['Enero':'Mayo',['huevos','jamon']]

         huevos  jamon
month
Enero        47   17.0
Febrero     110   31.0
Marzo       221   72.0
Abril        77   20.0
Mayo        132   52.0

In [28]:
#iloc

In [29]:
#Ejercicio Seleccion df usando iloc los siguiente  y utilizando listas
#los meses Enero,mayo, junio  y las columnas huevo sal